brew "git"
brew "stow"
brew "isync"
brew "notmuch"
brew "msmtp"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "jq"
brew "gnupg"
brew "coreutils"
brew "openssl@3"
brew "atuin"

# Runtimes/managers (optional)
brew "mise"    # or "asdf"

# GUI apps (examples)
cask "kitty"
cask "obsidian"

# App Store (optional, needs `brew install mas` first)
brew "mas"
# mas "Xcode", id: 497799835

